<?php
//000000000000a:31:{i:0;a:8:{s:5:"title";s:5:"3.3.1";s:11:"create_time";s:10:"1482997756";s:11:"update_time";s:10:"1482997756";s:3:"log";s:2423:"* 【修复】评论插件路径BUG

* 【调整】圈子后台方法放到公共function里面

* 【修复】修改手机文字显示错误

* 【调整】调整编辑器显示样式

* 【调整】调整活动编辑器快捷键

* 【修复】修复语言包出错的bug

* 【修复】取消论坛跳转路由功能,防止路由出错

* 【修复】注册页面更改网站标题还是显示os的bug

* 【修复】微博路由BUG

* 【修复】修复引用出错,导致报错  不能从字符串的偏移量也不重载对象/引用

* 【修复】修复消息编码不统一的bug

* 【调整】同步登录默认密码改为123456

* 【修复】公众号里微信同步登录也是扫码

* 【修复】修复文章内容或者其他内容详情过长导致get提交失败的BUG

* 【修复】修改手机文字错误

* 【调整】云市场安装模块后自动清除左侧菜单缓存

* 【修复】修复评论点赞不清微博缓存bug

* 【修复】修复开启头像上传时，头像没裁剪 导致聚合首页出现圆饼头像

* 【新增】地区找人参数过滤

* 【修复】地区找人sql注入漏洞

* 【调整】调整微博点赞

* 【调整】微博html缓存改用S()，不存数据库

* 【修复】修复后台不能更改推荐模块和热门模块的BUG

* 【调整】根据建议调整

* 【调整】调整点赞按钮位置

* 【修复】修复os自带聊天出现nbsp标识

* 【修复】替换状态bug修复

* 【调整】调整微博列表评论区域样式

* 【调整】调整微博详情页以及微博列表页样式

* 【新增】手机版上传头像

* 【修复】个人资料修改时提示框错位

* 【调整】模块安装后自动清除左侧菜单的缓存

* 【修复】修复语言包错误

* 【修复】后台广告排期zui日历改adminLTE日历

* 【修复】按地区找人路由BUG

* 【修复】修复后台一些语言包BUG

* 【修复】修复论坛和找人的路由规则BUG

* 【调整】资讯投稿时发布时间默认为当前时间

* 【修复】伪静态路由规则缺少活动的路由

* 【修复】活动编辑页标题错误

* 【删除】去掉右下角产品站工单三个按钮

* 【调整】前台分页加大可触面积

* 【新增】前台个人菜单加入申请认证

* 【修复】后台自动升级工具BUG
";s:3:"url";s:50:"http://os.opensns.cn/news/index/detail/id/511.html";s:6:"number";s:8:"20161229";s:4:"name";s:5:"3.3.1";s:10:"is_current";s:1:"0";}i:1;a:8:{s:5:"title";s:60:"3.3.0点我！升级前有额外操作，详情请看资讯~";s:11:"create_time";s:10:"1479977580";s:11:"update_time";s:10:"1479977580";s:3:"log";s:5663:"* 【修复】认证提醒消息链接地址错误

* 【新增】后台邮件配置增加验证方式的选择

* 【调整】微博js提取到公共js里面

* 【修复】排行榜个人排行加status=1

* 【修复】个人主页传的uid有误

* 【修复】修复图片过大加载时间太长的BUG

* 【修复】修复活动发布模块，进不去后台菜单的BUG

* 【调整】后台常用操作一行显示9个

* 【修复】快捷登录界面点立即注册js失效

* 【调整】不展示分享量

* 【修复】修复分享量展示bug

* 【调整】去除无用按钮

* 【修复】认证类型默认图标不展示

* 【调整】审核失败有原因并且申请要给相关审核人员发消息

* 【调整】个人主页传uid的判断调整

* 【新增】统计用户

* 【调整】用户导航缓存调整

* 【调整】个人主页链接里拼uid

* 【修复】个人主页路径里的uid为0

* 【新增】申请认证权限节点

* 【新增】名人堂用户调整为avatar_html128

* 【新增】新增query_user的avatar_html32等带认证图标的头像

* 【新增】新增认证相关表

* 【新增】认证用户列表：名人堂

* 【新增】认证主干部分完成

* 【新增】后台列表新增多图查看keyMultiImage

* 【新增】认证状态

* 【新增】认证相关代码

* 【新增】认证代码初始化

* 【新增】新增认证链接

* 【调整】调整用户认证相关内容

* 【新增】认证测试用图

* 【新增】认证页面及样式

* 【新建】新建认证分支

* 【调整】调整路由

* 【新增】 新增 get_url_with_domain 函数

* 【调整】调整页面微博布局，并为一块

* 【修复】修复论坛首页版块的文字错误

* 【新增】全站置顶右上角改为印章效果

* 【调整】后台分页使用之前的分页

* 【修复】个人主页uid为0的BUG

* 【修复】个人主页uid为0

* 【调整】插件方法路径去掉execute，暂时这么修改

* 【修复】修复 socket_check bug

* 【修复】广告设置无法选择时间BUG

* 【调整】排行榜缓存放到firstUserRun函数里执行

* 【调整】修改socket检测。写个缓存。每10分钟检测一次

* 【调整】排行榜性能优化

* 【调整】 去掉页面载入时的socket检测，如果遇到socket失效则手动删掉/Conf/ws.lock文件。

* 【调整】导航icon

* 【调整】调整云市场扩展代码，满足加密条件

* 【调整】取消使用builder，统一统计样式

* 【新增】在线用户列表及下线用户完成

* 【修复】去除后台登录页无用zui调用

* 【新增】在线用户列表以及下线用户功能

* 【修复】资讯站内分享无法生成微博

* 【修复】去掉 < 转义

* 【修复】将 < 转义

* 【修复】还原昨天~今天的版本库改动

* 【调整】调整云市场扩展内容位置，方便加密该部分

* 【调整】云市场结构调整

* 【修复】将  < 转义

* 【修复】点别人的个人主页跳转到自己主页

* 【删除】微博里删除解析虾米的代码

* 【修复】修复UC漏洞

* 【调整】addons路由调整

* 【新增】列表中分享到站外

* 【新增】列表站外分享

* 【修复】修复个性域名生成

* 【调整】调整addons路由

* 【修复】伪静态下无法站内分享

* 【调整】微博详情页缺少虾米样式

* 【调整】画廊图标图片名字改回原名

* 【调整】画廊图标图片名字重命名

* 【新增】个性域名数据表

* 【调整】调整群组路由规则

* 【调整】 调整群组manager页面的tag选中的样式

* 【调整】 增加路由正则匹配结果为 ''的判断，删除为空的参数

* 【新增】图片微博浏览时增加旋转图标

* 【调整】消息支持批量转移

* 【修复】补上论坛模块的伪静态路由

* 【调整】调整群组模块路由规则，暂时没有支持手机网页版。

* 【新增】图片微博浏览时增加左转和右转功能

* 【调整】消息优化，老数据单独存表

* 【修复】腾讯视频vid获取错误

* 【调整】注册页面文字改成“已有账号？”

* 【调整】页脚的公司内容改成后台可配置

* 【新增】完成用户个性域名

* 【调整】虾米音乐实时获取播放地址

* 【修复】后台用户列表“选择用户分组”点不开BUG

* 【新增】新增论坛模块路由

* 【调整】作者名称

* 【新增】群组路由

* 【新增】新增用户短路径

* 【新增】默认按钮样式

* 【修复】修复打包工具bug

* 【新增】新增 活动模块的路由

* 【新增】新增忽略模块

* 【新增】专辑模块 路由规则

* 【修复】后台群发消息错误提示

* 【修复】会员展示无用户时，推荐bug

* 【修复】修复敏感词后台菜单消失bug

* 【调整】置顶微博html内容加入缓存

* 【调整】侧边和顶部导航定位优化

* 【调整】后台去掉广告轮播TouchSlider风格选项

* 【调整】图片上传样式

* 【新增】新增路由判断，自动判断访问终端。

* 【调整】升级部分路由实现代码到TP3.2.3，支持全局路由

* 【调整】默认分页加大可触发范围

* 【新增】整合顶部导航链接到产品站，工单的三个按钮到右侧

* 【修复】登录框导致的页面颜色bug

* 【调整】登录页样式
";s:3:"url";s:50:"http://os.opensns.cn/news/index/detail/id/489.html";s:6:"number";s:8:"20161124";s:4:"name";s:5:"3.3.0";s:10:"is_current";s:1:"0";}i:2;a:8:{s:5:"title";s:5:"3.2.1";s:11:"create_time";s:10:"1476946603";s:11:"update_time";s:10:"1476946603";s:3:"log";s:1241:"* 【调整】个人主页的关注按钮风格不统一

* 【调整】论坛后台使用keyAutoComplete

* 【新增】新增keyAutoComplete

* 【调整】调整socket。判断socket是否连接，连接失败则重连。

* 【修复】修复微博sql的安装丢表操作

* 【修复】安装文件问题修复

* 【调整】去除update.sql内容

* 【新增】新增array_get_by_keys函数

* 【调整】socket只推动在微博首页~

* 【调整】查看大图中放大缩小使用中文

* 【修复】栋栋改导航bug

* 【调整】群组帖子列表去掉“作者”字样

* 【修复】发布资讯页面文字错误

* 【调整】后台自动升级小屏幕时加左右滚动

* 【调整】后台云市场小屏幕时加左右滚动条

* 【修复】默认用户组标签和扩展资料给默认值

* 【修复】网站端虾米音乐不能播放BUG

* 【修复】修复发布活动后 不能报名的BUG

* 【修复】聚合首页论坛右侧标题为空

* 【修复】未读消息过多时，只展示50条，并全部设为已读

* 【修复】个人主页关注/粉丝和头衔里链接错误

* 【修复】临时去除四格报告的请求
…………
……";s:3:"url";s:41:"http://os.opensns.cn/news/detail_469.html";s:6:"number";s:8:"20161020";s:4:"name";s:5:"3.2.1";s:10:"is_current";s:1:"0";}i:3;a:8:{s:5:"title";s:5:"3.2.0";s:11:"create_time";s:10:"1476322781";s:11:"update_time";s:10:"1476322781";s:3:"log";s:1190:"* 【新增】新增socket。

* 【修复】后台个人主页展示选项出现两次BUG

* 【调整】默认分页和微博评论分页美化

* 【修复】小名片上聊天和个人主页聊天优先使用阿里悟空

* 【修复】话题页面发动态，无法上传图片bug修复

* 【修复】找人模块 推荐bug

* 【新增】模块按身份可访问

* 【调整】去掉动态评论列表底部多出的一个像素的底线

* 【调整】修改邮箱后缀后清理缓存

* 【新增】第三方登录邮箱后缀 配置项

* 【新增】第三方同步登陆成功后那个个人资料里的邮箱的后缀xxx@xxx.com可以后台设置

* 【新增】我的社群卡片扩展，当超过4个的时候出现向下箭头，点击展开全部的社群功能

* 【修复】找人模块好友也关注显示错误

* 【修复】修复微博列表某些页面没内容bug

* 【新增】话题关注sql表

* 【调整】话题消息提示函数调整

* 【新增】积分日志导出

* 【新增】自动导出积分和行为日志
…………………………
……………………
………………
…………
……";s:3:"url";s:41:"http://os.opensns.cn/news/detail_464.html";s:6:"number";s:8:"20161013";s:4:"name";s:5:"3.2.0";s:10:"is_current";s:1:"0";}i:4;a:8:{s:5:"title";s:5:"3.1.1";s:11:"create_time";s:10:"1475031600";s:11:"update_time";s:10:"1475031600";s:3:"log";s:359:"*【修复】无注册方式时无报错bug修复

*【修复】系统升级过程中bug修复

*【修复】默认使用会话列表样式3

*【修复】后台用户搜索没有搜索结果时没有提示的BUG

*【修复】后台微博基本设置文字错误

*【修复】修复升级时出现的bug

*【修复】发布微博字数限制BUG";s:3:"url";s:41:"http://os.opensns.cn/news/detail_461.html";s:6:"number";s:8:"20160922";s:4:"name";s:5:"3.1.1";s:10:"is_current";s:1:"0";}i:5;a:8:{s:5:"title";s:83:"3.1.0【文章链接】升级前请详细阅读链接的文章，有额外操作。";s:11:"create_time";s:10:"1474200986";s:11:"update_time";s:10:"1474270800";s:3:"log";s:23977:"* 【修复】无注册方式时无报错bug修复

* 【修复】系统升级过程中bug修复

* 【修复】默认使用会话列表样式3

* 【修复】后台用户搜索没有搜索结果时没有提示的BUG

* 【修复】后台微博基本设置文字错误

* 【修复】发布微博字数限制BUG

* 【修复】修复升级时出现的bug

* 【修复】微博搜索页话题推荐bug修复

* 【修复】后台左侧模块里二级菜单不显示BUG

* 【修复】后台导航bug修复

* 【调整】后台不调用语言包

* 【修复】微博搜索页bug修复

* 【修复】修复话题bug

* 【修复】话题微博置顶bug修复

* 【修复】本地图片上传时无法获取宽高bug修复

* 【初始化】v3.1.0开原版

* 【修复】转换粉丝数int2str函数bug

* 【修复】会员展示设置数量大于总量时的bug

* 【调整】会员展示的多排序值显示会员

* 【新增】会员展示 不同排序值的推荐关注

* 【新增】会员展示后台设置推荐关注

* 【新增】会员展示后台增加好友推荐关注和随机推荐关注选项

* 【调整】自定义表情的宽度和高度

* 【删除】刚才新增的关注/取关功能

* 【新增】会员展示的关注和取消关注

* 【新增】找人的新人动态

* 【新增】自定义表情支持七牛上传

* 【新增】会员展示的推荐关注

* 【调整】表情分页样式

* 【调整】微博表情分页

* 【修复】上传自定义表情bug

* 【删除】dump缩略图

* 【新增】新增邮箱、手机号可编辑功能

* 【调整】美化链接图标

* 【调整】微博热议话题和新人发言图标

* 【调整】微博详情页样式

* 【新增】新消息加标题闪动

* 【修复】置顶隐藏时微博大图查看失败bug修复

* 【修改】微博热门图标

* 【新增】敏感词插件集成到V3开源版

* 【调整】热门微博图标和位置调整

* 【新增】点击评论按钮时，输入框自动获取焦点

* 【调整】调整热门微博图标

* 【新增】我的社群卡片扩展，当超过4个的时候出现向下箭头，点击展开全部的社群功能

* 【新增】热门微博标记

* 【调整】调整公告到达排序

* 【调整】微博点赞评论转发操作的点击区域

* 【调整】导航下拉菜单样式

* 【新增】找人模块 增加头像ucard

* 【调整】调整后台菜单获取，增加是否隐藏管理

* 【调整】去除重复执行调用

* 【修复】微博自定义表情无法上传bug

* 【调整】导航下拉框样式

* 【调整】图片宽高存入数据库

* 【修复】后台用户邮箱和手机方式搜索BUG

* 【调整】微博过滤的选择区域

* 【调整】微博过滤的搜索图标样式

* 【修复】图片管理排序bug修复

* 【修复】修复函数多次定义问题

* 【修复】按地区找人首页无数据bug

* 【调整】找人模块 按地区找人

* 【调整】微博过滤的搜索框样式

* 【新增】删除七牛图片功能

* 【新增】发布记忆功能

* 【调整】找人模块 编译css

* 【调整】发布微博时能同时插入表情和上传图片

* 【新增】后台所有页面加入添加常用操作的按钮

* 【调整】新版找人模块

* 【调整】热门话题样式

* 【调整】修改微博样式

* 【调整】发布框样式

* 【修复】微博过滤无效的bug

* 【新增】微博过滤，未完成

* 【新增】图片管理

* 【修复】图片水印设置bug修复

* 【调整】导航栏样式

* 【调整】发布类型框样式

* 【修复】转发消息模板选择错误bug修复

* 【修复】后台导航管理设置图标错乱BUG

* 【调整】调整微博缓存时间长度，4小时-》20分钟

* 【修复】修复置顶微博发布时间显示bug

* 【新增】图片水印兼容进系统中，并放到开源版

* 【修复】删除微博后处理微博话题

* 【调整】微博发布框样式

* 【新增】找人的新人动态

* 【修复】钩子编辑bug修复

* 【修复】微博评论返回错误后仍提示评论成功bug修复

* 【修复】渲染图片微博bug修复

* 【修复】后台二级菜单多出空的分类BUG

* 【新增】粉丝数量转化字符

* 【新增】会员展示的推荐关注

* 【修复】发布微博时@和topic消息渲染bug修复

* 【修复】默认允许注册方式

* 【调整】微博发布框样式

* 【调整】提前载入微博，优化体验

* 【修复】去除atwho中无用的调用Jquery.caret.map

* 【修复】修复微博分页bug

* 【修复】去除不存在文件的调用

* 【修复】评论bug修复

* 【修复】微博bug修复

* 【修复】微博评论发布后显示bug修复

* 【修复】微博缓存评论bug修复

* 【调整】调整微博内容的时间渲染进而提高微博html缓存时间

* 【修复】发布微博时没有执行相关替换

* 【调整】调整单次载入微博数

* 【调整】微博加html缓存，提高相应速度，测试

* 【修复】微博评论列表隐藏在打开无法显示的bug

* 【调整】后台session用db存储

* 【调整】系统版本号调整为3.0.3

* 【修复】删除错误SQL代码

* 【调整】后台session取消存数据库去除

* 【修复】系统安装sql中微博sql修复

* 【调整】微博版本号升级为3.0.0

* 【调整】登录页样式

* 【修复】后台admin无法登录BUG

* 【新增】微博圈子页面

* 【修复】个人主页中资料头衔粉丝这三个默认开启

* 【调整】前台分页样式错乱

* 【调整】分页总页数为1时不弹出下拉

* 【调整】默认分页的当前页去边框

* 【调整】默认分页样式调整

* 【调整】个人信息面板和个人主页样式调整

* 【调整】新人发言图片和样式微调

* 【修复】后台用户审核失败按钮点击提示非法操作BUG

* 【调整】默认分页修改

* 【新增】新人发言功能

* 【修复】gitignore或略过多bug修复

* 【调整】公告和微博话题样式微调

* 【新增】微博右侧话题排行

* 【修复】我的社群今日经验缺少积分类型判断

* 【修复】话题bug修复

* 【调整】微博话题功能优化

* 【修复】话题转移bug修复

* 【调整】微博头像取128×128

* 【调整】话题转移功能调整

* 【修复】发布公告的链接不自动增加http://

* 【修复】微博头像取64×64

* 【修复】话题转移bug修复

* 【修复】公告升级缺少数据库更新bug

* 【调整】调整话题转移

* 【调整】微博上关注按钮绑定事件改成函数

* 【调整】v2话题转移到v3改为长连接方式

* 【新增】话题转移功能

* 【调整】微博话题调整

* 【调整】话题设计优化——前台完成、后台未完成

* 【修复】loading不展示bug修复

* 【调整】个人主页样式

* 【修复】个人信息面板微博数无法正确显示的bug

* 【修复】后台菜单路径报错

* 【修复】微博列表关注按钮失效的bug

* 【修复】修复剩余经验错位

* 【新增】我的社群今日经验渲染以及做缓存

* 【调整】更新和编译css

* 【修改】我的社群面板无法判断是否签到的BUG

* 【修复】排行榜个人排名缓存BUG

* 【调整】我的社群面板增加是否登录的判断

* 【调整】调整404页面的位置

* 【修复】消息连续操作导致样式冲突bug修复

* 【调整】去除用户名注册方式

* 【修复】会话重载bug修复

* 【调整】调整会话样式和布局

* 【修复】修复推荐话题错位

* 【调整】消息框样式重新布局

* 【新增】loading8种样式扩展

* 【调整】友链插件改为widget调用

* 【新增】微博右侧我的社群面板

* 【修复】后台清理缓存不能用

* 【修复】模态框赋tag丢失bug修复

* 【修复】修复签到日历不显示bug

* 【修复】会话图标bug修复

* 【调整】微博详情样式

* 【调整】后台左侧子导航样式修改

* 【修复】message——logo模块中不显示bug修复

* 【修复】重新编译css

* 【修复】v2-》v3bug修复

* 【调整】后台左侧子导航一直展示

* 【修复】兼容v2调用

* 【调整】调整单个微博from左侧块长度

* 【调整】个人信息面板和签到日历

* 【修复】更新bug修复

* 【新增】鼠标悬停微博时未关注的人显示关注按钮

* 【调整】后台重置粉丝数去掉执行判断的条件

* 【调整】导航也页脚样式

* 【调整】全站搜索关键词参数传递问题

* 【调整】后台全站搜索模块可配置

* 【修复】后台模块管理图标不兼容

* 【修复】sql更新文件

* 【新增】全站搜索模块后台可编辑

* 【调整】签到日历样式

* 【调整】注册时验证码调整

* 【修复】邮箱注册激活失败BUG

* 【调整】全站搜索页面样式调整

* 【新增】全站搜索加入积分商城

* 【调整】邀请码类型有效时长做判断

* 【修改】v3版本号改为3.0.1

* 【修改】默认邀请码有效期修改

* 【修复】session表前缀写死bug修复

* 【调整】注册时验证码的修改

* 【新增】全站搜索加入群组、专辑、资讯

* 【调整】首页图片更换

* 【新增】后台增加重置粉丝数的按钮

* 【调整】发布微博插入表情和上传图片调整

* 【调整】v3-beta后小问题调整

* 【调整】个人主页样式

* 【调整】注册时只出现一个验证码

* 【修复】普通注册时缺少验证码

* 【修复】首个用户执行bug修复

* 【修复】AdminLTE。css import google文件导致不稳定bug修复

* 【修复】第一个访问用户执行统计等死循环bug修复

* 【新增】全站搜索加入群组

* 【修复】修复微博详情页评论样式

* 【修复】修复统计code丢失的bug

* 【新增】全站搜索加入活动和论坛

* 【新增】Conf文件夹加入版本库

* 【新增】首页增加登录页

* 【新增】首页类型选择设置

* 【调整】首页样式

* 【调整】将主色改为变量

* 【调整】身份创建删除冗余代码

* 【调整】给微博类型加入title提示

* 【调整】 调整fetchImage  getimagesize添加缓存

* 【调整】美化微博的评论列表样式

* 【调整】调整系统版本号

* 【新增】新增初始友情链接

* 【调整】调整页面文案

* 【调整】首页样式

* 【调整】首页，后台登陆央视

* 【调整】每天重置签到的连签

* 【调整】密码找回页面样式错位

* 【修复】注册时验证邮箱的URL有问题

* 【新增】增加顶部小图标

* 【调整】修改代码审查的错误

* 【修复】举报处理界面样式错位bug修复

* 【修复】提示消息错位看不到bug修复

* 【修复】注册提示信息bug修复

* 【调整】注册后的步骤样式修改

* 【调整】话题微博里插入表情、音乐、视频等窗口可随意切换

* 【调整】静态首页样式

* 【调整】微博插入表情和上传图片可以随意切换

* 【调整】用户搜索对搜索条件做判断

* 【调整】把远程获取图片尺寸的时间，修改为3秒限制

* 【调整】美化签到的圈

* 【调整】修改微博操作图标

* 【调整】注册后选择用户标签样式调整

* 【调整】message-error消息使用message-danger相同样式

* 【调整】找人模块搜索框样式调整

* 【调整】点击签到后实时更新累签和连签

* 【修复】微博页未登录状态下样式及登录提醒bug

* 【调整】微博插入表情、网页、音乐、视频等窗口可随意切换

* 【调整】删除多余文件

* 【调整】美化微博发布框样式

* 【调整】微博样式

* 【调整】css编译

* 【调整】自动生成的邀请码类型写入SQL

* 【修复】后台用户列表中搜索图标消失bug修复

* 【调整】注册后修改头像的页面头像错位

* 【调整】普通注册后相互关注，粉丝数加1

* 【调整】每日第一个用户做的事情，调整为异步发起请求。

* 【调整】微博样式

* 【调整】计划任务还原到骏涛的版本

* 【修复】注册后缺少相关步骤的BUG

* 【调整】身份设置默认头像无法跳过优化

* 【修复】身份设置默认头像无法跳过bug

* 【调整】邀请注册开启相互关注，粉丝数都加1

* 【新增】静态首页图片

* 【调整】静态首页样式

* 【新增】增加常用操作的权限节点

* 【调整】全站搜索查询无结果的页面调整

* 【调整】css编译

* 【调整】公告文字修改

* 【调整】公告修改

* 【调整】调整公告样式

* 【修复】css重新编译

* 【调整】全站搜索 搜索结果页面样式修改

* 【调整】公告按钮颜色调整

* 【修复】样式错位

* 【调整】优化体验

* 【调整】优化点赞消息和更换头像

* 【调整】微博和导航样式调整

* 【修复】注册开启邮箱验证后点击”输入邮箱验证码“的框也会弹出隐藏的验证码框

* 【调整】微博右侧样式

* 【修复】导航下拉错位

* 【修复】微博首页累签和连签渲染

* 【调整】微博样式

* 【新增】静态首页

* 【调整】导航与页脚样式

* 【调整】顶部增加会话入口

* 【新增】广告删除功能

* 【调整】微博首页签到日历累签和连签未登录时不显示

* 【调整】前台注册时间的渲染

* 【调整】排行榜页面样式

* 【调整】微博首页样式

* 【调整】member表粉丝值的获取。以及关注时fans值加1，取关时减1

* 【调整】统计取消使用计划任务

* 【调整】调整代码使之更易理解

* 【调整】微博模块样式

* 【新增】全站搜索增加找人

* 【调整】微博模块样式

* 【修复】公告重复显示bug

* 【修复】后台样式bug修复

* 【调整】优化会话列表关闭按钮范围

* 【调整】开启邀请注册时的提示

* 【修复】注册时输入了用户名却提示没有输入用户名

* 【修复】修复incode页面样式bug

* 【修复】计划任务数据库参数值错误修复

* 【调整】添加修改后台导航菜单

* 【调整】后台样式修改

* 【新增】全站搜索能搜索微博

* 【修复】排行榜配置没有给默认值

* 【修复】注册时图片验证码的框点取消无法隐藏

* 【修复】登出时后台权限列表无法删掉bug修复

* 【修改】注册页验证码输入框显示错误的bug

* 【调整】排行榜页面样式

* 【调整】修改资料页面样式

* 【调整】用户组更名为权限组

* 【修复】计划任务不自动启动bug

* 【修复】计划任务不自动启动bug修复

* 【修复】修复版本库同步后计划任务不自动启动问题

* 【修复】os-icon选择插件重选丢失bug修复

* 【调整】登录注册页面样式

* 【新增】导航图标simple-line-icon

* 【调整】常用操作不引channel.js

* 【修复】样式修复

* 【调整】排行榜显示后台可配置

* 【修复】php redirect之后，后续代码仍然会执行。要加上return

* 【新增】积分列表根据积分类型筛选

* 【修复】uc.php漏洞

* 【修复】修复后台导航设置和商业版不同步的bug

* 【修复】修复资讯页面调用老的广告钩子

* 【调整】调整后台文字

* 【修复】微博回复bug

* 【调整】修改2.8.2版本号

* 【修复】修复文字错误

* 【修复】在登出之后清理掉全部的session内容

* 【调整】后台顶部导航

* 【调整】使用最新的表情收藏样式

* 【修复】回复时出现被回复的内容

* 【调整】论坛删除帖子时，对回复也进行删除

* 【修复】修复图片无法上传问题

* 【修复】上传文件base64的bug

* 【调整】文件上传base64的bug

* 【调整】后台用户生日显示bug

* 【调整】个人资料的修改邮箱样式

* 【修改】返回顶部的图片链接地址

* 【修改】注册完成后头像上传页面错位

* 【修改】活动列表取数据时加status判断

* 【修复】后台扩展自动升级最新版本显示有误

* 【修改】登录后台时输入错误的账号密码没有提示

* 【新增】PC端点击链接，在手机模式访问下，跳手机端链接

* 【修复】注册的时候验证用户名是否为空

* 【修改】邮箱注册时，60S后提示是手机验证

* 【修复】后台用户被删除，但是前台其他用户我的关注或我的粉丝列表中仍显示该用户

* 【修复】公告消息bug修复

* 【修复】计划任务不自动启动bug

* 【调整】主题样式

* 【编译】css

* 【调整】排行榜做一个缓存

* 【调整】常用操作、排行榜BUG修复

* 【修复】V3-内测版-2 bug修复

* 【调整】输图片验证码时邮箱或者手机验证的div会隐藏

* 【新增】用户注册后默认收到一条系统消息

* 【修复】安装时不启动计划任务

* 【新增】版本库新增Conf文件夹

* 【调整】注册页少引js

* 【调整】会话和消息流程、样式、种类调整

* 【调整】邮箱注册和手机注册流程的修改

* 【调整】兼容栋栋写的会话列表

* 【新增】后台数据统计完成

* 【调整】主题和注册样式

* 【调整】默认主题样式

* 【调整】默认主题

* 【修复】活跃用户统计bug修复

* 【调整】后台首页样式提取和常用操作样式修改

* 【新增】常用操作拖拽保存排序功能

* 【新增】活跃度统计

* 【调整】统计展示方式调整

* 【新增】常用操作可供选择的图标

* 【新增】充值用户统计完成

* 【新增】常用操作修改图标和颜色功能

* 【新增】消费用户统计完成，差展示

* 【新增】加入版本库

* 【新增】完成留存率统计

* 【调整】登陆页样式

* 【调整】身份创建完成后跳到身份列表

* 【调整】登录页

* 【新增】用户流失率统计完成

* 【调整】去除常用操作冗余代码

* 【新增】新增常用操作tile表

* 【新增】常用操作的添加、删除功能

* 【新增】新增流失率统计

* 【新增】仪表盘常用操作的兼容

* 【新增】member表新增“粉丝数”字段

* 【新增】全站粉丝、连签、累签、积分排行榜

* 【新增】数据统计相关初始

* 【新增】网站在线人数统计（session存入数据库）

* 【修复】计划任务bug修复

* 【调整】登陆页样式

* 【修复】积分变动tip添加bug修复

* 【新增】完成用户组有效期功能

* 【修复】修复用户推出登录时权限session无法删除问题（去除$_SESSION设置）

* 【调整】优化消息弹出框用户体验

* 【新增】用户组有有效期，未完成

* 【新增】新增身份时能临时保存输入的信息

* 【新增】新增bootstrap的ajax模态并替换zui的ajax模态

* 【新增】补充css文件到版本库

* 【新增】osv2商业版的计划任务兼容进v3中

* 【新增】后台用户信息面板

* 【修复】修复显示消息数量图标初始display:none;

* 【修复】header消息去除

* 【新增】后台管理员可编辑用户昵称

* 【修复】用户扩展资料‘其他技能’多选时不能显示选中

* 【调整】前台导航个人信息面板

* 【修复】公告bug修复

* 【调整】点击范围调整，提高用户体验

* 【调整】消息系统优化调整

* 【修复】消息系统刷新bug修复

* 【修复】当消息内容为json数据时，toast的bug和last_message显示bug

* 【修复】登录消息提示bug修复

* 【新增】完成公告消息发送

* 【调整】图标选择调整优化

* 【调整】checkbox错位，样式调整

* 【新增】用户列表搜索增加邮箱和手机号搜索

* 【修复】图标选择bug，有无时错位

* 【新增】导航设置增加图标选择

* 【新增】OS-ICON图标及对应选择icon js插件

* 【修复】score信息cookie清除

* 【修复】导航管理修复

* 【修复】导航管理修复

* 【调整】优化签到日历刷新方式

* 【调整】签到版本号升级

* 【新增】签到绑定多行为

* 【新增】行为日志导出CSV

* 【调整】行为日志语言包

* 【新增】签到日历完成

* 【调整】活动模块代码调整

* 【调整】专辑模块代码整理

* 【调整】资讯模块代码

* 【调整】身份创建优化

* 【新增】消息系统完成（发消息没具体修改）

* 【调整】消息机制调整

* 【修复】公告链接检测bug修复

* 【修复】公告删除bug修复

* 【调整】公告内容类型和公告导航

* 【调整】调整模板展示

* 【新增】会话类型和消息列表

* 【修复】去除误提交的测试代码

* 【调整】邀请机制优化，注册时系统自动生成邀请码

* 【调整】行为日志筛选功能去掉打钩

* 【新增】后台行为日志按时间和行为筛选功能

* 【调整】微博模块代码调整，主要是css调整

* 【调整】编译后css同步

* 【修改】后台登陆页

* 【新增】会话列表

* 【调整】编译后css同步

* 【修改】后台icon 和部分表单控件样式

* 【修改】后台首页按钮样式，扩展中的云市场错位

* 【新增】消息前台侧滑块纯手工实现

* 【新增】发送消息流程实现（以微博部分为例）

* 【修改】后台字体

* 【新增】进行消息机制的初始架构

* 【调整】cookie超时时间去除

* 【新增】后台管理员可编辑用户扩展信息

* 【新增】全站公告前台一半（除去消息部分）

* 【新增】公告后台

* 【修复】插件adminlist列表顶部导航

* 【修复】兼容bootstrap的datetimepicker，不用adminlte的时间选择

* 【修复】兼容chosen，使用adminlte的select2

* 【修复】修复adminTreeBuilder样式

* 【新增】左侧导航做成osv3-metronic样式

* 【修复】 扩展-》模块管理界面样式调整

* 【调整】调整admin模块css目录结构

* 【修复】插件列表页和模块列表页样式全丢

* 【升级】升级系统版本至2.7.8-》2.8.0

* 【修复】插件列表页tab样式修复

* 【新增】设置adminlte按钮及面板

* 【修复】搜索按钮点击下拉失效

* 【修复】列表、表格样式修复

* 【新增】adminlte中新增toast插件

* 【修改】调整bootstrap的目录结构

* 【修复】tab选项卡修复

* 【修改】kanban使用metronic的nestable，并兼容进adminlte

* 【修复】后台adminlte兼容tab选项卡

* 【修改】修改左侧统一导航

* 【修改】后台顶部导航用adminlte做成之前metronic的样式

* 【初始化】创建osv3-adminlte分支";s:3:"url";s:42:" http://os.opensns.cn/news/detail_461.html";s:6:"number";s:8:"20160918";s:4:"name";s:5:"3.1.0";s:10:"is_current";s:1:"0";}i:6;a:8:{s:5:"title";s:5:"2.8.2";s:11:"create_time";s:10:"1467598649";s:11:"update_time";s:10:"1473088043";s:3:"log";s:36:"修复了图片无法上传的问题";s:3:"url";s:0:"";s:6:"number";s:8:"20160704";s:4:"name";s:5:"2.8.2";s:10:"is_current";s:1:"0";}i:7;a:8:{s:5:"title";s:5:"2.8.1";s:11:"create_time";s:10:"1467360219";s:11:"update_time";s:10:"1473087997";s:3:"log";s:36:"修复了上传组件的一个漏洞";s:3:"url";s:0:"";s:6:"number";s:8:"20160701";s:4:"name";s:5:"2.8.1";s:10:"is_current";s:1:"0";}i:8;a:8:{s:5:"title";s:5:"2.8.0";s:11:"create_time";s:10:"1465981993";s:11:"update_time";s:10:"1473087941";s:3:"log";s:615:"【新增】手机访问电脑版网页时可以自动跳转到对应的手机版
【修复】后台用户列表中用户被删除或禁用后，前台其他用户仍   然能在关注或粉丝列表中找到该用户
【修复】邮箱注册时，激活链接提示激活失败
【修复】用户名注册时，不填写用户名，只填写昵称和密码就可进入下一步
【修复】后台无法修改昵称，一直提示错误
【修复】登陆后台时，账号密码错误没有提示，一直显示正在登录
【修复】邮箱注册时，60S验证后，再次提示验证时，提示语错误";s:3:"url";s:0:"";s:6:"number";s:8:"20160615";s:4:"name";s:5:"2.8.0";s:10:"is_current";s:1:"0";}i:9;a:8:{s:5:"title";s:5:"2.7.9";s:11:"create_time";s:10:"1460453060";s:11:"update_time";s:10:"1460453060";s:3:"log";s:386:"* 【修改】聊天内容靠右BUG
* 【修改】聊天内容靠左和切换聊天对象
* 【修复】无法发起聊天bug
* 【修改】返回顶部图片bug
* 【修改】在搜索页面的个人信息展示文字头衔会被当做图片头衔使用
* 【修复】友情链接，语言包等bug
* 【修改】删除微博无提示
* 【修改】返回顶部图片不显示
";s:3:"url";s:0:"";s:6:"number";s:8:"20160412";s:4:"name";s:5:"2.7.9";s:10:"is_current";s:1:"0";}i:10;a:8:{s:5:"title";s:5:"2.7.8";s:11:"create_time";s:10:"1459416230";s:11:"update_time";s:10:"1459416230";s:3:"log";s:1015:"* 2.7.8
* 【修改】用户组描述修改后权限配置丢失bug
* 【修改】邮箱密码找回，邮箱不能为空
* 【修改】签到详情页切换到今日签到时连续签到和累计签到不显示
* 【修改】游客需要登录才能进行回复操作
* 【修改】语言包里的注册提示
* 【修改】'我的收藏'中增加群组帖子
* 【修复】新增绑定手机号和邮箱
* 【修改】默认表情禁止收藏
* 【修改】注册时密码输入提示的完善
* 【修改】设置用户的积分
* 【修复】签到详情页右侧数据未显示
* 【修复】表情收藏bug
* 【修复】文字显示错误。
* 【修改】增加个人中心默认看板
* 【修改】表情收藏破图，自定义表情解析美化
* 【修复】表情功能按钮美化
* 【修复】补充homeIndex钩子给移动端入口插件
* 【修改】表情收藏无法解析，默认启用，添加刷新问题
* 【新增】表情分页，上传
* 【修改】表情收藏
";s:3:"url";s:0:"";s:6:"number";s:8:"20160331";s:4:"name";s:5:"2.7.8";s:10:"is_current";s:1:"0";}i:11;a:8:{s:5:"title";s:5:"2.7.7";s:11:"create_time";s:10:"1454634305";s:11:"update_time";s:10:"1454634305";s:3:"log";s:1393:"* 【修改】表情收藏
* 【修改】签到插件增加积分代码优化
* 【修改】签到插件代码优化
* 【新增】表情收藏功能
* 【修改】修改数据表字段
* 【新增】后台表情上传和分页。
* 【新增】新增ListBuilder tips，用于在页面上上显示提示信息
* 【修复】修复搜索页用户小名片不显示，修复个人主页地址错误
* 【修改】新增个人中心默认看板
* 【修复】微博图片
* 【修改】将迁移帖子模板移到forum模块
* 【修复】微博图片
* 【修复】修复昵称导致的502
* 【修复】修复昵称获取错误
* 【修复】修复at昵称错误
* 【修复】修复了改掉表前缀的情况
* 【修复】修复了改掉表前缀的情况下，全站昵称获取不到
* 【修复】修复ActionLog页面
* 【修复】个人中心bug修复
* 【修改】修改同步登录插件，修复登录多次创建多个帐号的bug
* 【修复】用户个人中心相关bug修复
* 【修复】伪静态路由解析bug
* 【修改】修复添加缓存之后所有插件失效的bug
* 【修复】修复sendVerify
* 【修改】修改发送验证码是输入验证码
* 【优化】优化性能，防止注入
* 【修复】后台登陆后前台身份没登陆bug修复
* 【修复】身份错误提示错位bug修复
* 【修复】登出js bug修复

";s:3:"url";s:0:"";s:6:"number";s:8:"20160205";s:4:"name";s:5:"2.7.7";s:10:"is_current";s:1:"0";}i:12;a:8:{s:5:"title";s:5:"2.7.6";s:11:"create_time";s:10:"1451972620";s:11:"update_time";s:10:"1451972620";s:3:"log";s:598:"* 【同步】同步商业版一些代码用于阿里悟空聊天
* 【修复】修复thumb函数
* 【修复】调整变量名
* 【调整】加入全局的word-break
* 【修复】邮箱注册提示页面多语言
* 【改进】改进微博性能
* 【优化】优化微博列表速度，添加新的缓存
* 【修复】修复无法检测到新的升级
* 【修改】php输出js语言包
* 【修复】修复get_nickname
* 【修复】修复微博广告位
* 【新增】兼容红包插件
* 【改进】改进函数性能query_user，性能提高10倍
* 【修复】修复JS语言";s:3:"url";s:0:"";s:6:"number";s:8:"20160105";s:4:"name";s:5:"2.7.6";s:10:"is_current";s:1:"0";}i:13;a:8:{s:5:"title";s:5:"2.7.5";s:11:"create_time";s:10:"1450665739";s:11:"update_time";s:10:"1450665739";s:3:"log";s:1486:"* 【修改】PC图片上传进度
* 【多语】移除问答的语言
* 【修复】修复语言函数不存在的bug
* 【新增】获取user_config的函数
* 【修改】PC密码找回。
* 【修复】修复个人中心的语言包错误
* 【新增/修改】手机网页版首页自定义，微博图片上传进度（未完成）
* 【增加多种类型积分奖励。】
* 【修改了虾米插件的js，增加了回车键搜索歌曲功能。】
* 【修复】修复微博管理后台多语
* 【新增】密码找回
* 【新增】手机网页版密码找回。
* 【增加签到积分奖励，后台可设置奖励的积分的类型和数值。】
* 【修复】修复内容高度
* 【修改】结果很简单，只是没想到---微博隐藏冲突
* 【给商品和活动的站内分享增加了封面，增加了个人主页的聊天按钮。】
* 【增加了活动页，论坛帖子和积分商城的商品页的站内微博分享。】
* 【修复】微博置顶隐藏
* 【bug】微博图片显示
* 【修复】修复找人样式
* 【修复】2.7.2话题字体颜色 和网站链接颜色是否不对应该是白色
* 【增加了地区人数显示，修改地区字体，增加用户的地区标签】
* 【提交漏交的area.html和mod_header_area.html】
* 【增加了一个area.html和mod_header_area.html。在zh-cn.php中增加了'地区标签找人'，在_nav.html中增加了地区标签。增加了对地区显示的css样式。】";s:3:"url";s:0:"";s:6:"number";s:8:"20151221";s:4:"name";s:5:"2.7.5";s:10:"is_current";s:1:"0";}i:14;a:8:{s:5:"title";s:5:"2.7.2";s:11:"create_time";s:10:"1449628263";s:11:"update_time";s:10:"1449628263";s:3:"log";s:597:"* 【广告位】修复
* 【修复】针对英文单词，无法按单词换行bug修复
* 【优化】调整listBuilder的按钮颜色
* 【多语】修复网站信息多语
* 【新增】新增广告的时候，加入返回列表按钮
* 【新增】新增Config—>buttonLink
* 【修复】修复Builder表单提交错误
* 【修复】修复Builder __SELF__ 变量问题
* 【修复】修复AdminListBuilder的文字
* 【修复】修复注册参数错误
* 【修复】微博图
* 【优化】微调样式
* 【调整】关闭语言侦测
* 【修复】修复install安装引导";s:3:"url";s:0:"";s:6:"number";s:8:"20151209";s:4:"name";s:5:"2.7.2";s:10:"is_current";s:1:"0";}i:15;a:8:{s:5:"title";s:56:"2.7.1，请看更新日志，再更新，有额外操作";s:11:"create_time";s:10:"1449107289";s:11:"update_time";s:10:"1449107289";s:3:"log";s:578:"升级到导入sql语句，1.点击执行，不会提示导入成功，但实际已经执行;2.点跳过，进入下一步
* 【修复】修复install安装引导
* 【修复】修复提示窗组件
* 【修复】修复addons初始化钩子错误
* 【新增】后台开关IM功能
* 【调整】调整钩子名称
* 【调整】拆分导航栏样式
* 【优化】默认不展示广告位工具条
* 【修复】修复轮播排序
* 【修复】修复语言、模块检测
* 【多语化】专辑
* 【修复】修复广告位错误
* 【修复】修复模态弹窗";s:3:"url";s:0:"";s:6:"number";s:8:"20151203";s:4:"name";s:5:"2.7.1";s:10:"is_current";s:1:"0";}i:16;a:8:{s:5:"title";s:15:"2.7.0 广告牌";s:11:"create_time";s:10:"1449040556";s:11:"update_time";s:10:"1449040556";s:3:"log";s:1461:"* 【调整】将不必要的代码移入_system
* 【新增】插件初始化钩子方法
* 【优化】优化回到顶部
* 【修复】T生成四级目录时去除default层
* 【主题】增加调用接口
* 【修改】模板增加临时调用方法
* 【bug】电脑版用户在没登陆的状态下，看到的热门文章掉到最下面了
* 【优化】调整模块广告位，采用新机制
* 【修复】资讯bug修复
* 【新增】支持轮播图排序
* 【修复】IIS7+的伪静态配置文件去除多余的内容
* 【修复】修复群组详情页编辑器报错
* 【改进】改进keyCity
* 【新增】支持直接从广告管理进入广告编辑
* 【新增】加入广告排期查看
* 【框架】升级后台ZUI框架
* 【修复】修复用户组管理的文字错误
* 【调整】调整默认主题样式
* 【新增】支持listBuilder的width设置
* 【新增】升级过也可以下载补丁
* 【修复】后台错误的时候提示
* 【修复】修复等级
* 【修复】修复后台页面在小屏幕上，显示不全的bug
* 【优化】优化广告位没内容时的占位表现形式
* 【新增】积分日志加入搜索支持
* 【修复】修复空的情况下，多图上传有空图
* 【新增】后台积分日志管理
* 【新增】微博我的喜欢功能
* 【修复】群组图标和导航错误
* 【新增】支持后台自定义用户导航
* 【修复】微博详情页";s:3:"url";s:41:"http://os.opensns.cn/news/detail_321.html";s:6:"number";s:8:"20151202";s:4:"name";s:5:"2.7.0";s:10:"is_current";s:1:"0";}i:17;a:8:{s:5:"title";s:5:"2.6.2";s:11:"create_time";s:10:"1446517979";s:11:"update_time";s:10:"1446517979";s:3:"log";s:285:"* 【修复】活动L
* 【修复】邮箱注册提示信息以及period显示
* 【优化】优化多图上传组件
* 【优化】优化本地评论没内容的展示样式
* 【L】修复followmodel
* 【L】若干修复
* 【修复】微博ucenter显示
* 【修复】误删";s:3:"url";s:0:"";s:6:"number";s:8:"20151103";s:4:"name";s:5:"2.6.2";s:10:"is_current";s:1:"0";}i:18;a:8:{s:5:"title";s:5:"2.6.1";s:11:"create_time";s:10:"1446107625";s:11:"update_time";s:10:"1446107625";s:3:"log";s:143:"* 【版本库】移除Mob文件
* 【修复】修复多处多语化错误
* 【修复】修复拼写错误
* 【修复】用户列表加入";s:3:"url";s:0:"";s:6:"number";s:8:"20151029";s:4:"name";s:5:"2.6.1";s:10:"is_current";s:1:"0";}i:19;a:8:{s:5:"title";s:6:"2.6.0 ";s:11:"create_time";s:10:"1446010231";s:11:"update_time";s:10:"1446010231";s:3:"log";s:1752:"* 【新增】对敏感词的支持

* 【新增】后台首页加入主程序版本号

* 【修复】throw exception改成调用系统E()函数

* 【修复】错误被屏蔽，显示白屏bug修复

* 【修复】后台插件页面显示错误

* 【修复】修复主题有新版本

* 【新增】支持主题升级

* 【修改】手机网页版密码找回

* 【BUG】资讯详情页显示错位

* 【修改】为广告位添加缓存

* 【修改】修改更新sql文件 

* 【修改】开启app_debug 模式下广告位没有广告提示广告位置名称

* 【优化】安装的时候数据库信息错误提示人性化

* 【修改】修改广告位置插件，广告位置自动添加。并可以与主题绑定

* 【修复】微博首页问题修改版

* 【修复】群组伪静态bug修复

* 【修改】微博图片显示中文及其他

* 【优化】增加用户列表对用户名、邮箱和手机号的显示

* 【修改】微博图片长宽显示

* 【调整】调整评论样式 

* 【新增】新增权限判断相关函数

* 【修改】微博图片显示

* 【修复】修复自动升级模块的时候商品图片出不来的问题

* 【修改】微博图片展示效果更改

* 【修复】修复裁剪

* 【修复】修复UploadBase64

* 【优化】优化form_check.js,增加外部调用方法

* 【BUG】首页找人模块标题显示

* 【BUG】后台群组排序

* 【BUG】积分商城图标显示

* 【调整】调整群组同步微博的URL

* 【BUG】菜单栏显示&群组微博自动同步显示

* 【修复】修复云市场的图片路径

* 【修改】修改积分类型为double

* 【补充】补充Expression文件夹";s:3:"url";s:41:"http://os.opensns.cn/news/detail_287.html";s:6:"number";s:8:"20151028";s:4:"name";s:5:"2.6.0";s:10:"is_current";s:1:"0";}i:20;a:8:{s:5:"title";s:5:"2.5.1";s:11:"create_time";s:10:"1444269949";s:11:"update_time";s:10:"1444269949";s:3:"log";s:207:"* 【BUG】二级菜单的菜单栏显示
* 【修复】修复云市场的图片路径
* 【L】微博（-admin-widget）
* 【修改】修改积分类型为double
* 【补充】补充Expression文件夹";s:3:"url";s:0:"";s:6:"number";s:8:"20151008";s:4:"name";s:5:"2.5.1";s:10:"is_current";s:1:"0";}i:21;a:8:{s:5:"title";s:16:"2.5.0  多语者";s:11:"create_time";s:10:"1443575463";s:11:"update_time";s:10:"1443575463";s:3:"log";s:3030:"* 【补充】补充Expression文件夹

* 【新增】新增话题链接表

* 【调整】调整微博发布

* 【修复】修复群组首页挂载的群组连接错误

* 【新增】新增topic的表

* 【新增】支持restful

* 【修复】修复同步登陆伪静态

* 【修复】修复论坛handleAt

* 【修复】在回复微博的时候显示了备注昵称，在本地评论的时候显示了备注昵称，改为真实昵称。

* 【修复】修复小名片自己也显示关注。

* 【修复】修复资讯样式

* 【新增】新增微博换行排版

* 【新增】资讯来源加入外链

* 【新增】增加对消息的轮询的配置

* 【修复】修复专辑的布局

* 【修复】修复备注昵称错误

* 【修复】修复签到显示昵称错误的问题。

* 【新增】新增小名片原昵称显示

* 【修复】修复推送

* 【调整】调整小名片的显示

* 【修复】修复用户列表用户更新不及时的问题

* 【新增】增加钩子，完善update和install.sql

* 【新增】增加对[at:uid]的解析

* 【调整】调整at组件的输出

* 【修复】修复用户列表用户更新不及时的问题

* 【修复】修复微博评论列表昵称更新不及时

* 【修复】修复昵称为空的情况

* 【新增】补充签到和举报的中文翻译

* 【新增】在小名片昵称右边加入 备注 入口

* 【多语化】文章、专辑、论坛、群组

* 【修复】修复群组导航栏样式错位

* 【新增】补充SEO设置。

* 【多语化】论坛、文章、专辑、群组

* 【多语化】找人&资讯

* 【修改】各模块多语化

* 【改进】在身份设置中加入一个取消选中的选项

* 【改进】群发用户列表 加入 用户搜索功能

* 【BUG】后台的导航部分设置无效

* 【修复】修复云市场模块目录的URL问题

* 【设计】同步登陆插件在后台可以设置初始身份ID

* 【改进】群组样式错位

* 【BUG】设置文字头衔；但是在身份，绑定头衔处，出现一个图片位置，显示无图

* 【修复】修复seo website_name无效的问题

* 【修复】地址加上http://

* 【修复】伪静态后404缺少bug修复

* 【新增】SEO支持变量的提示，对SEO进行模块分类，补充大量SEO规则

* 【新增】加入多语支持

* 【修复】修复后台U函数生成前台地址bug

* 【调整】调整提示文字

* 【修复】修复论坛同步到微博的图片重复

* 【修复】复制功能路径修复

* 【BUG】在个人设置时无效，禁用的用户名和昵称仍能使用

* 【bug】火狐下聊天样式有错

* 【修复】修复聊天的错误

* 【改进】积分规则列表列出积分

* 【改进】手机验证加入170等其他的开头方式

* 【修复】修复对多超级管理员的时候的支持

* 【BUG】论坛楼中楼回复中的头衔显示错误";s:3:"url";s:41:"http://os.opensns.cn/news/detail_250.html";s:6:"number";s:8:"20150930";s:4:"name";s:5:"2.5.0";s:10:"is_current";s:1:"0";}i:22;a:8:{s:5:"title";s:53:"2.4.5，点此下载文章中的附件覆盖升级。";s:11:"create_time";s:10:"1440142811";s:11:"update_time";s:10:"1440142811";s:3:"log";s:1183:"* 【修复】修复表情大小写问题
* 【修复】修复火狐图标问题
* 【修复】修复部分主机下无法安装的Bug
* 【修复】修复二级导航错位
* 【修复】修复论坛无法删除其他人的帖子的bug
* 【修改】加入系统信息
* 【修复】修复首页不受皮肤插件影响的BUG
* 【修复】初始化没身份用户时过滤掉被删除、禁用的身份
* 【修复】修复插件和主题无法安装的问题
* 【优化】在无session写入权限的时候改进tmp，自动创建
* 【修复】修复SEO等列表页面，文字过长的时候导致显示不全的问题，至少兼容1366px宽
* 【优化】颜色选择用户使用优化
* 【修复】builder颜色选择默认颜色bug修复
* 【修复】排序不能选择bug修复
* 【修改】uc登录时的bug
* 【新增】新增admin.php管理入口
* 【修复】修复论坛搜索展示错误的问题
* 【修复】修复图片无法显示的问题
* 【修复】修复图片url判断
* 【修复】修复Ueditor样式错误
* 【修复】修复聊天默认无图和小红点无法消除的bug
* 【修复】修复消息的用户列表的分页";s:3:"url";s:41:"http://os.opensns.cn/news/detail_208.html";s:6:"number";s:8:"20150821";s:4:"name";s:5:"2.4.5";s:10:"is_current";s:1:"0";}i:23;a:8:{s:5:"title";s:27:"2.4.1 远程图片url修复";s:11:"create_time";s:10:"1439364001";s:11:"update_time";s:10:"1439364001";s:3:"log";s:371:"* 【修复】修复图片无法显示的问题
* 【修复】修复图片url判断
* 【修复】修复积分商城排版错位问题
* 【修复】zclip插件
* 【修复】修复Ueditor样式错误
* 【修复】复制功能js相对路径bug
* 【修复】修复聊天默认无图和小红点无法消除的bug
* 【修复】修复消息的用户列表的分页";s:3:"url";s:0:"";s:6:"number";s:8:"20150812";s:4:"name";s:5:"2.4.1";s:10:"is_current";s:1:"0";}i:24;a:8:{s:5:"title";s:14:"2.4.0开发版";s:11:"create_time";s:10:"1439179494";s:11:"update_time";s:10:"1439179494";s:3:"log";s:1901:"* 【调整】在文件解压失败的时候终止升级程序并报错。
* 【版本库】版本库内新增文件
* 【修改】Ueditor新增粘贴word图片的功能。
* 【调整】去除个人主页的邮箱显示
* 【修复】修复安装包错误
* 【修复】二级域名下论坛发帖同步微博图片路径bug修复
* 【修复】用户注册bug
* 【调整】调整清缓存的样式
* 【调整】修复下载的地址
* 【新增】新增模块编辑的Token写入
* 【修复】修复取图片修复路径的时候的https开头判断
* 【调整】模块编辑加入写token
* 【调整】调整友情链接插件样式
* 【修复】修复ucenterMember的require_once路径bug
* 【新增】后台设置用户身份
* 【修复】修复设置个人标签tab无法选中
* 【调整】加入权限的修复
* 【改进】优化模块安装机制，更加稳定
* 【修复】用户注册步骤标签选择跳过失败
* 【修复】头衔申请时，连续点两次，申请了两次
* 【修复】修复注册bug
* 【修改】后台新增头衔时，没有图片的时候默认不出现或者是提示无；
* 【修复】积分规则中，规则中的行为类型无论选的是用户还行系统，编辑是都会展示是系统
* 【修复】身份扩展资料bug修复
* 【修复】扩展字段二级类型修复
* 【调整】禁用后台隐藏模块菜单
* 【调整】调整支持插件
* 【优化】增加标签面板最大高度设置，超过部分出现显示、隐藏按钮
* 【修复】缩小搜索按钮宽度
* 【修复】修复头衔的显示
* 【修复】js cookie 前缀 调用后台配置值
* 【新增】自动升级clean_cache()
* 【修复】js cookie增加默认前缀获取后台配置项
* 【修复】头衔修改bug修复
* 【新增】新增函数 home_addons_url
* 【修复】修复自动升级权限问题";s:3:"url";s:0:"";s:6:"number";s:8:"20150810";s:4:"name";s:5:"2.4.0";s:10:"is_current";s:1:"0";}i:25;a:8:{s:5:"title";s:80:"V2正式版，升级过程中会丢失登陆，重新登录再升级一遍即可";s:11:"create_time";s:10:"1437542458";s:11:"update_time";s:10:"1437543468";s:3:"log";s:3315:"新增列表：

* 【新增】为手机发送验证码添加倒计时。
* 【新增】加入favicon
* 【新增】后台可以配置资讯的排序方式，更新时间还是创建时间或则查看量+每页展示条数
* 【新增+修复】新增群组首页调用+论坛首页调用去除不存在论坛
* 【新增】【优先级3】用户行为日志加入按UID搜索
* 【新增】将手机短息服务商更改为插件，同时支持多家短信服务商
* 【新增】给予其他用户管理权限后，希望能和超级管理员一样有一个后台入口 并更新安装包
* 【新增】体验改进，聚合首页的微博模块中图片时，点击并不是当前页面放大，是打开一个网页展示
* 【新增】支持Ucenter互联
* 【新增】会员展示更名为找人，加入根据身份过滤
* 【新增】排除掉Admin模块的伪静态，规则强制为3

其他改动列表：

* 【修复】修复Cloud自动升级的问题
* 【修复】修复模块自动升级版本检测问题 
* 【修复】修复自动升级文件夹创建BUG
* 【修复】用户标签，在后台禁用或者删除后，清理缓存，在前台个人设置中仍能找到该标签bug修复。小名片头衔bug修复
* 【修复】头衔申请bug修复 
* 【修改】资讯中将二级分类禁用后，前台仍能看到。
* 【修改】用户改名后，微博显示的用户名改了，但是@时的用户名没有及时修改。存在缓存。（高亮效果也是，存在缓存）
* 【修改】注册时头像上传的样式有错
* 【修复】微博中后台回复被删除或者禁用后，前台计算微博条数时，仍计入
* 【修改】设置样式
* 【修改】用户行为筛选之后翻到第二页仍然没有筛选效果
* 【修改】把聊天移到导航栏
* 【修复】修复找回密码地址错误
* 【修改】伪静态设置提示修改
* 【修改】修改发布微博。评论微博默认积分规则
* 【修复】资讯列表页分类展示bug修复
* 【修改】修改注册时扩展资料无法跳过问题
* 【修改】修改同步登录远程图片上传到云服务器
* 【修改】修改群组审核通知。修改群组最大创建限制。
* 【修改】修改同步登录
* 【调整】调整表情新增的文字提示
* 【修改】判断session前缀，修改后台session前缀
* 【修复】伪静态模式下上传头像，返回路径使用绝对路径
* 【修复】首页资讯展示不出作者bug修复
* 【修复】修复找人面板数据处理bug
* 【修复】在注册页面点登陆按钮进行登陆时出现重定向循环错误
* 【修复】修复模块编辑的一个清缓存的错误
* 【优化】找人后台可管理显示身份tab
* 【修复】修复Linux无法进行代码覆盖的问题
* 【修复】修复版块缓存问题
* 【修改】修改邮箱账户正则匹配
* 【还原】随便看看数量后台控制
* 【还原】随便看看展示数量还原为30个
* 【修复】论坛随便看看无内容+【新增】后台可以控制每页显示的论坛帖子数
* 【还原】用户名昵称验证被覆盖，现在还原
* 【修改】用户中心邮箱验证BUG
* 【修复】伪静态文件内容补全
* 【修改】论坛获取版主等的id方法";s:3:"url";s:41:"http://v2.opensns.cn/news/detail_151.html";s:6:"number";s:8:"20150722";s:4:"name";s:5:"2.3.0";s:10:"is_current";s:1:"0";}i:26;a:8:{s:5:"title";s:14:"2.2.0开发版";s:11:"create_time";s:10:"1436419697";s:11:"update_time";s:10:"1436419697";s:3:"log";s:4288:"* 【打包】补充在线升级的menu
* 【新增】在安装的时候自动写入token
* 【改进】在获取模块升级信息的时候，忽略掉没有token的模块
* 【修复】修复论坛帖子回复的用户头衔不显示的问题
* 【修复】修复自动升级BUG
* 【新增】加入扩展升级最后一步同步版本号
* 【新增】加入代码升级
* 【修改】修改block内嵌block标签的错误
* 【修改】站外分享插件统一调用common->widget->ShareWidget.class.php
* 【修改】增强form_check.js验证规则
* 【新增】新增扩展自动更新第三步入口
* 【修复】修复文字头衔出不来的问题
* 【新增】加入取缩略图的简写函数thumb
* 【新增】后台注册用户统计加入星期提示
* 【新增】支持扩展自动升级比对代码
* 【新增】新增扩展自动更新第一步
* 【调整】调整安装提示文字
* 【新增】后台自动更新支持，支持进入到自动更新页面
* 【调整】调整新版本获取方式，兼容性更好，解决了前台报错的问题。
* 【修复】listbuilder的右侧过滤和查询不能同时生效，需要能够同时生效
* 【完成】伪静态
* 【修复】分享带中文url进行urlencode（）和urldecode（），避免伪静态自动解码
* 【修复】严谨url路由解析方式
* 【修改】群组内帖子标题换行时错位的bug
* 【修改】修改微博话题权限管理
* 【添加】注释
* 【修改】修改上传图片提示信息
* 【修改】修改判断上传驱动插件函数
* 【新增】群组伪静态规则
* 【修改】判断上传驱动插件是否存在
* 【新增】开源版伪静态规则
* 【修改】修改附件以及图片上传和渲染机制
* 【调整】微博个人部分的头衔展示
* 【调整】【头衔】各模块头衔调用调整为最新的方式
* 【新增】新增资讯首页
* 【新增】自动升级加入提示
* 【路由配置】
* 【修复】用户升级身份bug修复
* 【修改】伪静态增强判断严谨性
* 【调整】新增UserRankWidget，统一用户头衔展示
* 【新增】对curl的错误信息判断
* 【新增】新增公共排版样式
* 【修复】修复群组发现分页
* 【修复】合并后台配置bug修复
* 【模块】区分本地和远程模块
* 【新增】新增模块样式
* 【调整】调整模块管理页面样式
* 【修改】头衔新增文字头衔+Admin/Builder/AdminConfigBuilder.class.php增加颜色选择器keyColor()
* 【修复】头衔审核的权限节点丢失+群组、SEO Think\Controller:doClear方法不存在！
* 【修复】审核头衔的时候微博同步的显示用户昵称而不是用户名
* 【修改】用户名、昵称长度修改为后台配置
* 【优化】如果系统设置新用户注册时关注人，结果信息提示只是“关注了你”，应该是“系统推荐的XX关注了
* 【修复】活动列表页面报名按钮丢失
* 【修改】修改登录提示
* 【修改】本地评论游客能删除游客评论的bug
* 【修改】修改上传表情包提示
* 【修改】修改论坛。资讯后台修改提交过滤
* 【修复】1.在用户标签列表分类回收站 彻底删除用户标签删除不了，提示Think\Controller:doClear方法不存在！
2、用户行为,发布活动日志不会显示?
* 【修复】修复了数据表配置bug
* 【修复】微博隐藏置顶cookie时间session->1年
* 【修改】群发消息调用函数
* 【新增】core成为系统公共模块，供权限节点等挂载
* 【新增】【模块管理】如果模块后台入口为空，则不显示在后台的左侧菜单栏中
* 【调整】调整快捷登陆窗口的验证码大小
* 【修复】修复数据表内容导出时的特殊字符被textarea转义的错误
* 【修改】修改论坛。专辑。资讯 视频过滤
* 【修复】修复array_diff在linux服务器执行结果不同。
* 【修复】编辑器内容多出好多br
* 【修复】修复微博话题主持人无法编辑话题
* 【修复】未审核角色登录bug
* 【新增】新增自动更新时的文件权限检测，防止不够写入权限而无法覆盖文件
* 【修改】修复腾讯视频无法抓取";s:3:"url";s:0:"";s:6:"number";s:8:"20150709";s:4:"name";s:5:"2.2.0";s:10:"is_current";s:1:"0";}i:27;a:8:{s:5:"title";s:18:"RC sp1，可更新";s:11:"create_time";s:10:"1434610054";s:11:"update_time";s:1:"0";s:3:"log";s:204:"* 【调整】完善后台注册配置的文字提示
* 【修改】修改 addons_url 函数。增加显示域名参数
* 【修改】修改本地评论
* 【修改】修改ueditor获取视频swf链接";s:3:"url";s:0:"";s:6:"number";s:8:"20150618";s:4:"name";s:5:"2.1.1";s:10:"is_current";s:1:"0";}i:28;a:8:{s:5:"title";s:5:"RC版";s:11:"create_time";s:10:"1434502800";s:11:"update_time";s:10:"1434502800";s:3:"log";s:6981:"* 【新增】新增搜索框，但未完成搜索功能。
* 【新增】安装模块的时候，如果模块的前台entry为空，则不出现添加导航功能
* 【新增】新增获取用户全部积分方法
* 【新增】实现自动更新文件覆盖
* 【新增】新增本地比较
* 【新增】新增本地文件比较
* 【新增】完成自动升级第一步
* 【新增】开发者工具
* 【新增】自动升级的版本确认
* 【新增】新增积分日志。用于记录积分的操作。以及调用方法
* 【新增】完成自动升级最后一步
* 【新增】新增数据库导入功能
* 【新增】活动编辑器加入附件功能
* 【新增】广告和广告位插件
* 【新增】支持在线更新手动下载
* 【新增】短信接口提示服务商
* 【新增】configbuilder支持单文件上传
* 【新增】新增多文件上传插件
* 【新增】资讯、论坛中加入代码高亮 同时修复高亮后代一行码过长bug
* 【新增】新增后台新版本监测
* 【新增】论坛后台分类、板块管理页面
* 【新增】后台自动更新模板
* 【新增】论坛加入首页调用
* 【新增】实现后台自动安装
* 【新增】新增插件的在线安装
* 【新增】新增用户积分及行为的前台显示。
* 【新增】文章模块
* 【新增】支持主题在线安装
* 【新增】新增对token的验证反馈
* 【新增】后台消息群发
* 【新增】支持后台安装的跳转
* 【新增】模块在安装的时候支持自动添加导航栏


* 【调整】完全禁用活动二级分类
* 【修改】伴随AdminListBuilder的清空和彻底删除修改
* 【修复】修复微博清空回收站。
* 【修复】【系统】系统-》网站设置-》用户设置中，新注册的用户发布微博到网站中的功能尚未实现，是否先屏蔽
* 【调整】调整微博源微博变量名。
* 【修复】【活动】活动详情页的样式稍作调整，报名按键和文字太靠近
* 【修复】还原clear功能
* 【修复】修复转发的提示错误
* 【调整】调整微博变量名称
* 【调整】调整会员展示头部的间距
* 【修改】积分模型修改
* 【修复】用户投稿时，未审核通过仍能分享到微博，其他用户可以通过微博访问该文章内容。但是资讯搜索时无该文章
* 【修改】广告位置去掉微店首页
* 【修改】修改编辑器保存间隔
* 【修复】修复首页展示的实效项目
* 【修复】修复【查看积分】个人设置中查看积分时，每天显示用户当前的等级
* 【修复】修复论坛权限bug
* 【调整】在后台编辑活动分类的时候，父分类不显示二级的
* 【修复】修复新增用户行为里，为系统的不显示的问题。
* 【调整】调整后台微博评论的排序
* 【修复】修复后台群组编辑添加错误
* 【修复】修复微博回收站无法彻底删除的bug
* 【调整】用户行为默认展示全部，【用户行为】用户-》用户行为中，在系统模块下新增了用户行为，只显示9条行为，其他的不显示，也无法翻页
* 【修复】首页链接错误
* 【修复】修复注册上传头像错位
* 【调整】调整升级进度计算方式。
* 【修改】移除用户的不缓存字段
* 【移除】移除icons_html无用变量
* 【修复】修复问答编辑器ctrl+enter错误
* 【修复】默认广告位配置
* 【修改】修改积分缓存清理方法。支持多用户多类型
* 【修改】修改清除积分缓存方法
* 【修改】修改添加行为后清除积分和等级缓存
* 【调整】调整云市场的链接
* 【修复】修复自动更新提示
* 【升级包】打包自动升级部分
* 【修复】修正自动更新完成的提示文字
* 【修改】修改游客@用户的情况
* 【修改】在用户行为中，加上新增的积分规则的列标题
* 【修改】修改注册时发送两条消息的bug
* 【修改】修改消息提示
* 【修复】修复个人主页粉丝和关注的错位
* 【修复】补上重置用户密码的权限
* 【修复】修复后台错误提示页面
* 【修改】修改sourse
* 【修改】修改adminconfig 以及本地评论调用
* 【优化】给getPagination()和Model中getPage()增加一个rollPage参数，控制分页栏每页显示的页数
* 【调整】资讯编辑器宽度调整到和展示页相同宽度
* 【调整】活动编辑器宽度调整为和页面差不多宽
* 【修改】修改微博插件额外参数过滤调用
* 【修改】op.php
* 【修复】修复上传文件无法保存的问题
* 【修复】单文件上传没有文件时不显示删除按钮
* 【调整】调整自动升级
* 【修复】修复关注可以通过get的方式的细节。禁止get关注
* 【修复】修复资讯内容展示bug
* 【修复】论坛bug修复及后台分类、板块优化
* 【添加】论坛漏加入版本库的文件加入
* 【修复】主题安装bug修复
* 【修复】论坛改进
* 【修复】修复模块安装时的权限问题
* 【修复】修复默认权限出错的时候导致所有权限丢失。
* 【修复】修复注册和登陆的链接地址
* 【修复】修复二级导航样式错误
* 【修改】修改注释
* 【修复】修复score个人信息出不来。
* 【修复】修复用户身份设置样式bug
* 【添加】论坛行为权限限制
* 【调整】调整提示文字
* 【修复】修复导航栏样式问题
* 【修复】修复次级导航样式
* 【修复】修复部分安装Bug
* 【修改】消息修改
* 【修改】 签到插件修改
* 【修复】后台邀请码列表分页bug
* 【修改】修改签到，支持按行为签到
* 【修改】安装包修改。消息表
* 【修改】修改因调整sendmessage方法而错误的其他方法
* 【修改】未登录的时候资讯仍然可以被分享，但是分享出来的微博是无用户的。
* 【修改】没有权限的时候直接在群组的导航栏里就提醒没有权限，而不是到提交表单才提示。
* 【修复】修复个人主页微博点赞
* 【修改】安装文件sql
* 【调整】调整云市场
* 【修复】修复样式问题
* 【调整】在底部加上官网链接
* 【修复】模板解析bug修复
* 【修复】主题解析错误修复
* 【修改】修改消息提示信息
* 【修复】资讯审核文章时，审核失败内容填写时超过100个字仍能发表成功
* 【新增】用户行为新增过滤
* 【调整】用户前台积分规则按模块分组
* 【修改】修改 发送消息函数，并修改调用的参数
* 【修改】修改编辑器视频
* 【修改】过滤微博视频flash地址发布。群组视频过滤
* 【调整】调整二级导航样式
* 【修改】修改配置
* 【调整】调整模块未安装时的文字提示，更加友善。";s:3:"url";s:62:"http://v2.opensns.cn/index.php?s=/news/index/detail/id/86.html";s:6:"number";s:8:"20150617";s:4:"name";s:5:"2.1.0";s:10:"is_current";s:1:"0";}i:29;a:8:{s:5:"title";s:7:"beta版";s:11:"create_time";s:10:"1432332000";s:11:"update_time";s:10:"1434503126";s:3:"log";s:6:"暂无";s:3:"url";s:37:"http://www.opensns.cn/article/17.html";s:6:"number";s:8:"20150602";s:4:"name";s:5:"2.0.5";s:10:"is_current";s:1:"0";}i:30;a:8:{s:5:"title";s:18:"开发者预览版";s:11:"create_time";s:10:"1431651600";s:11:"update_time";s:10:"1434503121";s:3:"log";s:6:"暂无";s:3:"url";s:41:"http://www.opensns.cn/article/16_200.html";s:6:"number";s:8:"20150515";s:4:"name";s:5:"2.0.0";s:10:"is_current";s:1:"0";}}
?>